03-For-an-editor/init-org-mode.org
*** Configuration
#+begin_src emacs-lisp :tangle yes
;;================================================================
;; Config for TODO Configuration
;;================================================================
;; (setq org-todo-keywords
;;       (quote (;;(sequence "TODO(t)" "NEXT(n)" "MAYBE(m)" "STARTED(s)" "APPT(a)" "|" "DONE(d)")
;;               (sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "|" "DONE(d)")
;;               (sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))

(setq org-todo-keywords
      (quote ((sequence "TODO(t)" "NEXT(n)" "STARTED(s)" "MAYBE(m)" "|" "DONE(d!/!)")
              (sequence "PROJECT(p)" "|" "DONE(d!/!)" "CANCELLED(c@/!)")
              (sequence "WAITING(w@/!)" "HOLD(h)" "|" "CANCELLED(c@/!)"))))

(setq org-todo-keyword-faces
      (quote (;;("NEXT" :inherit warning)
              ("PROJECT" :inherit font-lock-string-face)
              ("TODO" :foreground "red" :weight bold)
              ("NEXT" :foreground "blue" :weight bold)
              ("STARTED" :foreground "green" :weight bold)
              ("DONE" :foreground "forest green" :weight bold)
              ("WAITING" :foreground "orange" :weight bold)
              ("MAYBE" :foreground "grey" :weight bold)
              ("HOLD" :foreground "magenta" :weight bold)
              ("CANCELLED" :foreground "forest green" :weight bold)
              )))


(setq org-use-fast-todo-selection t)
(setq org-todo-state-tags-triggers
      (quote (("CANCELLED" ("CANCELLED" . t))
              ("WAITING" ("WAITING" . t))
              ("MAYBE" ("WAITING" . t))
              ("HOLD" ("WAITING") ("HOLD" . t))
              (done ("WAITING") ("HOLD"))
              ("TODO" ("WAITING") ("CANCELLED") ("HOLD"))
              ("NEXT" ("WAITING") ("CANCELLED") ("HOLD"))
              ("DONE" ("WAITING") ("CANCELLED") ("HOLD")))))

#+end_src
*** Shot-key bindings
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
|               | C-c C-t                    | 设置TODO标签                                                                              |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
** Config for Tag
*** Configuration
#+begin_src emacs-lisp :tangle yes
;;================================================================
;; Config for Tags
;;================================================================
;; Config TODO tags
(setq org-tag-alist '((:startgroup)
                      ("Develop" . ?1)
                      (:grouptags )
                      ("陆健美" . ?z)
                      (:endgroup)

                      ))
;; Allow setting single tags without the menu
(setq org-fast-tag-selection-single-key (quote expert))

;; For tag searches ignore tasks with scheduled and deadline dates
(setq org-agenda-tags-todo-honor-ignore-options t)

#+end_src
*** Shot-key binding
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Tags          | C-c C-c C-c                | 打开tag选择窗口，然后通过字母索引选择tag                                                  |
|               | SPC                        | 清除所有tag                                                                               |
|               | C-c C-c                    | 可以直接输入tag的单词直接进行选择                                                         |
|               | C-c C-x C-c                | 打开列展示视图                                                                            |
|               | q                          | 退出列视图                                                                                |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
** Global column view and properties
    Column view是建立于org-mode任务管理之上的快速以表格查看各个任务情况的视图，可以使用 *C-c C-x C-c* 来打开column view，而此种查看方式只是一种查看，并不会被打印，如果需要通过动态管理column view，并支持打印，可以通过 *C-c C-x i* 插入一个动态的column部分在文件中，但此部分不是动态关联的，即修改了任务内容，插入的column view是不会更新的，但可以通过执行 *C-c C-x C-u* 进行更新；注：已经通过配置(add-hook 'before-save-hook 'org-update-all-dblocks)达到在保存文件时，即会更新文件中所有的column view中的数据；
    当需要针对某一个特定的任务组生成一个column view时，可以在此任务组的任务上，执行 *C-c C-x p* 插入属性，选择id，输入一个id值，然后在插入动态column时，选择刚刚输入的id值即可；如果需要对这个表特殊定义不同的column结构，可以再执行 *C-c C-x p* 时选择 *COLUMN* 来重新定义一个新的column结构内容；保存即可自动更新表s格；
#+begin_src emacs-lisp :tangle yes
;;================================================================
;; Config for Global column view and properties
;;================================================================
;; Set default column view headings: Task Effort Clock_Summary
;;(setq org-columns-default-format "%25ITEM %10Effort(Effort){:} %SCHEDULED %DEADLINE %11Status %20TAGS %PRIORITY %TODO")
;;(setq org-columns-default-format "%25ITEM  %9Approved(Approved?){X} %SCHEDULED %DEADLINE %11Status %TAGS %PRIORITY %TODO")
(setq org-columns-default-format
      ;;" %TODO %30ITEM %15DEADLINE %15SCHEDULED %3PRIORITY %10TAGS %5Effort(Effort){:} %6CLOCKSUM"
      " %TODO %30ITEM %15DEADLINE %15SCHEDULED %3PRIORITY %10TAGS %5Effort(Effort){:}"
      )

;; global Effort estimate values
;; global STYLE property values for completion
(setq org-global-properties (quote (
                                    ;;("Effort_ALL" . "0:15 0:30 0:45 1:00 2:00 3:00 4:00 5:00 6:00 0:00")
                                    ("Status_ALL" . "Not-start In-Progress Delay Finished Cancled")
                                    ("ID_ALL" . "")
                                    ("STYLE_ALL" . "habit"))))
;; update dynamic blocks when save file
(add-hook 'before-save-hook 'org-update-all-dblocks)


#+end_src

*** Shot-key binding
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| column        | C-c C-x C-c                | 打开column视图模式                                                                        |
|               | r                          | 刷新                                                                                      |
|               | q                          | 退出                                                                                      |
|               | <left> <right> <up> <down> | 视图之间跳转                                                                              |
|               | v                          | 查看属性完整值                                                                            |
|               | C-c C-x i                  | 插入column视图在文件中                                                                    |
|               | C-c C-x C-u                | 更新column视图中的值，需要进入表格中执行                                                  |
|               | C-u C-c C-x C-u            | 更新此文件中所有的column视图内容                                                          |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|
| Property      | C-c C-x p                  | 设置一个属性                                                                              |
|               | C-c C-x p COLUMN           | 设置column，内容可以为%25ITEM 10%ITEM 5%TODO 30%SCEDULE 30%DEADLINE                       |
|---------------+----------------------------+-------------------------------------------------------------------------------------------|

** Config for File Export HTML Format

